fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Программное создание элементов формы
	ВКМ_СоздатьЭлементыФормыСервер();
	
	// Установка видимости при открытии
	ВКМ_УстановитьВидимостьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// Вызываем серверную процедуру для управления видимостью
	ВКМ_УстановитьВидимостьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_СоздатьЭлементыФормыСервер()
	
	// Проверяем, не созданы ли элементы ранее (защита от ошибок)
	Если Элементы.Найти("ВКМ_ГруппаСрокДоговора") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Создание группы для дат (горизонтальная группа для красоты)
	ВКМ_ГруппаСрокДоговора = Элементы.Вставить("ВКМ_ГруппаСрокДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ВКМ_ГруппаСрокДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаСрокДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ВКМ_ГруппаСрокДоговора.Заголовок = "Период действия договора";

	// 2. Добавление поля ВКМ_ДатаНачала в группу
	ВКМ_ДатаНачала = Элементы.Вставить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ВКМ_ГруппаСрокДоговора);
	ВКМ_ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		
	// 3. Добавление поля ВКМ_ДатаОкончания в группу
	ВКМ_ДатаОкончания = Элементы.Вставить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ВКМ_ГруппаСрокДоговора);
	ВКМ_ДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	// 4. Добавление поля ВКМ_СуммаАбонентскойПлаты (после группы)
	ВКМ_СуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	 
	// 5. Добавление поля ВКМ_СтоимостьЧасаРаботы
	ВКМ_СтоимостьЧасаРаботы = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ЭтотОбъект);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_УстановитьВидимостьНаСервере()
	
	// Определяем условие видимости
	НужныйВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	ЭтоАбонент = (Объект.ВидДоговора = НужныйВидДоговора);
	
	// Управляем видимостью групп и полей
	Элементы.ВКМ_ГруппаСрокДоговора.Видимость = ЭтоАбонент;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонент;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ЭтоАбонент;
	
КонецПроцедуры

#КонецОбласти
